tickets/app/services/calculate_ticket_price_service.rb

    def self.calculate_price(event_id, ticket_type)
        event = Event.find_by(id: event_id)
        if event
            if ticket_type == 'ordinary'
                base_price = event.ordinary_ticket_price
                base_count = event.ordinary_ticket_count
                current_count = event.tickets.where(ticket_type: ticket_type, status: 'free').count
            elsif ticket_type == 'vip'
                base_price = event.vip_ticket_price
                base_count = event.vip_ticket_count
                current_count = event.tickets.where(ticket_type: ticket_type, status: 'free').count
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."event_id" = $1 AND "tickets"."ticket_type" = $2 AND "tickets"."status" = $3  [["event_id", 1], ["ticket_type", "ordinary"], ["status", "free"]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."event_id" = $1 AND "tickets"."ticket_type" = $2 AND "tickets"."status" = $3  [["event_id", 1], ["ticket_type", "vip"], ["status", "free"]]