tickets/app/services/create_tickets_service.rb

    def self.create(event)
        # не прописываю поле user_id, так как билет ещё не куплен
        event.ordinary_ticket_count.times do
            event.tickets.create(ticket_type: 'ordinary', status: 'free')
        end
        event.vip_ticket_count.times do
            event.tickets.create(ticket_type: 'vip', status: 'free')
---
INSERT INTO "tickets" ("ticket_type", "status", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticket_type", "ordinary"], ["status", "free"], ["created_at", "2024-04-25 12:19:25.961066"], ["updated_at", "2024-04-25 12:19:25.961066"], ["event_id", 1]]
INSERT INTO "tickets" ("ticket_type", "status", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticket_type", "vip"], ["status", "free"], ["created_at", "2024-04-25 12:19:27.710409"], ["updated_at", "2024-04-25 12:19:27.710409"], ["event_id", 1]]