tickets/app/services/create_event_service.rb

INSERT INTO "events" ("name", "date", "ordinary_ticket_count", "vip_ticket_count", "ordinary_ticket_price", "vip_ticket_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def self.create(event_params)
        Event.create(
            name: event_params['name'],
            date: event_params['date'],
            ordinary_ticket_count: event_params['ordinary_ticket_count'].to_i,
            vip_ticket_count: event_params['vip_ticket_count'].to_i,
            ordinary_ticket_price: event_params['ordinary_ticket_price'].to_f,
            vip_ticket_price: event_params['vip_ticket_price'].to_f
        )
        CreateTicketsService.create(Event.last)
        Event.last