tickets/app/services/get_ticket_service.rb

    def self.get_ticket(ticket_id)
        ticket = Ticket.find_by(id: ticket_id)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]