tickets/app/services/update_ticket_service.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = $1 AND (ticket_type = 'vip' and status = 'free') ORDER BY "tickets"."id" ASC LIMIT $2  [["event_id", 1], ["LIMIT", 1]]
UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", "booking"], ["updated_at", "2024-04-26 18:20:20.927941"], ["id", 11]]
---
    def self.create_booking(event_id, ticket_type)
        unless Event.find_by(id: event_id)
            return {status: 404, body: "not find event"}
        end
        ticket = Event.find_by(id: event_id).tickets.where(
            'ticket_type = :ticket_type and status = :ticket_status', ticket_type: ticket_type, ticket_status: 'free'
        ).first
        if ticket
            price = CalculateTicketPriceService.calculate_price(event_id, ticket_type)[:body]
            ticket.status = 'booking'
            ticket.save

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", "free"], ["updated_at", "2024-04-26 17:12:13.428973"], ["id", 11]]
---
    def self.delete_booking(ticket_id)
        ticket = Ticket.find_by(id: ticket_id)
        if ticket.nil?
            result = {status: 404, body: "no ticket with id = #{ticket_id}"}
        elsif ticket.status == 'booking'
            ticket.status = 'free'
            ticket.save

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tickets" SET "user_id" = $1, "status" = $2, "updated_at" = $3 WHERE "tickets"."id" = $4  [["user_id", 42], ["status", "buy"], ["updated_at", "2024-04-26 09:54:54.142221"], ["id", 12]]
---
    def self.buy_ticket(ticket_id, user_id)
        ticket = Ticket.find_by(id: ticket_id)
        if ticket.nil?
            result = {status: 404, body: "no ticket with id = #{ticket_id}"}

        elsif ticket.status == 'booking'
            ticket.status = 'buy'
            ticket.user_id = user_id
            ticket.save

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", "block"], ["updated_at", "2024-04-26 09:57:52.026947"], ["id", 12]]
UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", "buy"], ["updated_at", "2024-04-26 10:01:12.105831"], ["id", 12]]
---
    def self.block_ticket(ticket_id, block)
        ticket = Ticket.find_by(id: ticket_id)
        if ticket.nil?
            result = {status: 404, body: "no ticket with id = #{ticket_id}"}
        elsif block and ticket.status == 'buy'
            ticket.status = 'block'
            ticket.save
            result = {status: 201, body: {
                id: ticket.id,
                event_id: ticket.event_id,
                type: ticket.ticket_type,
                status: ticket.status }
            }
        elsif !block and ticket.status == 'block'
            ticket.status = 'buy'
            ticket.save